Revit 2024 API
NonContinuousRailInfo Methods
The NonContinuousRailInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidNonContinuousRailHeight
 Checks whether the input height is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailMaterial
 Checks whether an ElementId is a valid material Id of a non-continuous rail.
IsValidNonContinuousRailName
 Checks whether the input name is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailProfile
 Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace